#+title: Emacs — Packages — Org Mode
#+setupfile: ../headers
#+property: header-args:emacs-lisp  :mkdirp yes :lexical t :exports code
#+property: header-args:emacs-lisp+ :tangle ~/.config/emacs/lisp/org.el
#+property: header-args:emacs-lisp+ :mkdirp yes :noweb no-export

** Babel
One of the amazing features of org-mode is its literary programming capacities by running code blocks from within Org-mode itself. But for that, only a couple of languages are supported directly by Org-mode itself, and they need to be activated. Here are the languages I activated in my Org-mode configuration:

#+NAME: org-babel-languages-table
| C          |
| emacs-lisp |
| gnuplot    |
| latex      |
| makefile   |
| python     |
| shell      |
| sql        |

#+NAME: org-babel-languages-gen
#+header: :cache yes :results replace
#+header: :var languages=org-babel-languages-table[,0]
#+BEGIN_SRC emacs-lisp :exports none :tangle no
(format "'(%s)"
        (mapconcat (lambda ($language)
                     (format "(%s . t)" $language))
                   languages
                   "\n  "))
#+END_SRC

#+RESULTS[b0a5bea13e6ba99525ad166ea5538e74ba4c6ddc]: org-babel-languages-gen
#+begin_example
'((C . t)
  (emacs-lisp . t)
  (gnuplot . t)
  (latex . t)
  (makefile . t)
  (python . t)
  (shell . t)
  (sql . t))
#+end_example

The corresponding code is as follows:
#+NAME: org-babel-load-languages
#+BEGIN_SRC emacs-lisp :noweb yes :tangle no
(org-babel-do-load-languages
 'org-babel-load-languages
 <<org-babel-languages-gen()>>)
#+END_SRC

Some languages can run asynchronously with the help of ~ob-async~.
#+begin_src emacs-lisp
(use-package ob-async
  :straight (:build t)
  :defer t
  :after (org ob))
#+end_src

A package I use from time to time is ~ob-latex-as-png~ which allows me
to easily convert a LaTeX snippet into a PNG, regardless of the
exporter I use afterwards. Its installation is pretty simple:
#+begin_src emacs-lisp
(use-package ob-latex-as-png
  :after org
  :straight (:build t))
#+end_src

A nice thing to have when working with REST APIs is to have a REST
client. Even better if it can work inside org-mode!
#+begin_src emacs-lisp
(use-package ob-restclient
  :straight (:build t)
  :defer t
  :after (org ob)
  :init
  (add-to-list 'org-babel-load-languages '(restclient . t)))
#+end_src

** Capture
Org capture is an amazing tool for taking quick notes, be it simple
text, links, resources, or reminders. They are all organised in
specified org files which are described below.
#+name: org-capture-target-files
#+begin_src emacs-lisp :tangle no
(defvar org-notes-file (expand-file-name "notes.org" org-directory))
(defvar org-journal-file (expand-file-name "journal.org" org-directory))
(defvar org-novel-file (expand-file-name "novel.org" org-directory))
(defvar org-agenda-file (expand-file-name "private.org" org-agenda-directory))
(defvar org-inbox-file (expand-file-name "inbox.org" org-agenda-directory))
#+end_src

When ~org-capture~ is invoked, it will ask which template we wish to
use. In the table [[org-capture-shortcuts-table]], the /key/ column
represents which keychord we need to hit, titled with /name/, we need to
hit in order to use the /template/, inserted in the designated /file/ in
the manner described by /insertion mode/.

;| j        | Journal       |           | file+datetree  | org-journal-file        | journal.orgcaptmpl       |

#+name: org-capture-shortcuts-table
| Shortcut | Name          | Title     | Insertion mode | file                    | template                 |
|----------+---------------+-----------+----------------+-------------------------+--------------------------|
| e        | Email         |           |                |                         |                          |
| ew       | Write Email   | Emails    | file+headline  | org-default-notes-file  | email.orgcaptmpl         |
| i        | Inbox         |           | file+headline  | org-inbox-file          | notes.orgcaptmpl         |
| l        | Link          |           |                |                         |                          |
| ll       | General       |           | file+headline  | org-default-notes-file  | link.orgcaptmpl          |
| ly       | YouTube       |           | file+headline  | org-default-notes-file  | youtube.orgcaptmpl       |
| L        | Protocol Link | Link      | file+headline  | org-default-notes-file  | protocol-link.orgcaptmpl |
| n        | Notes         |           |                |                         |                          |
| nc       | Conlanging    | Note      | file+headline  | org-conlanging-file     | notes.orgcaptmpl         |
| nn       | General       |           | file+headline  | org-default-notes-file  | notes.orgcaptmpl         |
| nN       | Novel         | Note      | file+headline  | org-novel-notes-file    | notes.orgcaptmpl         |
| nq       | Quote         |           | file+headline  | org-default-notes-file  | notes-quote.orgcaptmpl   |
| nw       | Worldbuilding | Note      | file+headline  | org-wordbuilding-file   | notes.orgcaptmpl         |
| N        | Novel         |           |                |                         |                          |
| Ni       | Ideas         |           | file+headline  | org-novel-notes-file    | notes.orgcaptmpl         |
| p        | Protocol      | Link      | file+headline  | org-default-notes-file  | protocol.orgcaptmpl      |
| r        | Resources     |           |                |                         |                          |
| rc       | Conlanging    | Resources | file+headline  | org-conlanging-file     | resource.orgcaptmpl      |
| re       | Emacs         |           | file+headline  | org-default-notes-file  | resource.orgcaptmpl      |
| ri       | Informatique  |           | file+headline  | org-default-notes-file  | resource.orgcaptmpl      |
| rl       | Linguistics   |           | file+headline  | org-default-notes-file  | resource.orgcaptmpl      |
| rL       | Linux         |           | file+headline  | org-default-notes-file  | resource.orgcaptmpl      |
| rw       | Worldbuilding | Resources | file+headline  | org-wordbuilding-file   | resource.orgcaptmpl      |
| t        | Tasks         |           |                |                         |                          |
| tb       | Birthday      |           | file+headline  | org-private-agenda-file | birthday.orgcaptmpl      |
| te       | Event         |           | file+headline  | org-private-agenda-file | event.orgcaptmpl         |
| th       | Health        |           | file+headline  | org-private-agenda-file | health.orgcaptmpl        |
| ti       | Informatique  |           | file+headline  | org-private-agenda-file | informatique.orgcaptmpl  |

All templates can be found [[https://labs.phundrak.com/phundrak/dotfiles/src/branch/master/org/capture][in my dotfiles' repository]].

#+name: org-capture-shortcuts-gen
#+header: :exports none :cache yes :tangle yes
#+begin_src emacs-lisp :var entries=org-capture-shortcuts-table
(setq org-agenda-capture-template-directory (expand-file-name "capture/" org-directory))
(mapconcat (lambda (entry)
             (let ((key      (nth 0 entry))
                   (name     (nth 1 entry))
                   (title    (nth 2 entry))
                   (ins-mode (nth 3 entry))
                   (file     (nth 4 entry))
                   (template (nth 5 entry)))
                (if (string= "" ins-mode)
                    (format "%S" `(,key ,name))
      (format "(\"%s\" \"%s\" entry\n  %S\n  %S\n  :empty-lines 1)"
        key name
                          (if (string= "file+datetree" ins-mode)
                              `(,(intern ins-mode) ,(intern file))
                            `(,(intern ins-mode) ,(intern file) ,(if (string= title "")
                                                                name
                                                              title)))
                          `(file ,(concat org-agenda-capture-template-directory template))))))
           entries
           "\n")
#+end_src

#+RESULTS[9f565c3dd73becfad0a99c0cfaf4521762334b40]: org-capture-shortcuts-gen
#+begin_example
("e" "Email")
("ew" "Write Email" entry
  (file+headline org-default-notes-file "Emails")
  (file (expand-file-name "email.orgcaptmpl" org-agenda-capture-template-directory)))
("j" "Journal" entry
  (file+datetree org-journal-file ##)
  (file (expand-file-name "journal.orgcaptmpl" org-agenda-capture-template-directory)))
("l" "Link")
("ll" "General" entry
  (file+headline org-default-notes-file "General")
  (file (expand-file-name "link.orgcaptmpl" org-agenda-capture-template-directory)))
("ly" "YouTube" entry
  (file+headline org-default-notes-file "YouTube")
  (file (expand-file-name "youtube.orgcaptmpl" org-agenda-capture-template-directory)))
("L" "Protocol Link" entry
  (file+headline org-default-notes-file "Link")
  (file (expand-file-name "protocol-link.orgcaptmpl" org-agenda-capture-template-directory)))
("n" "Notes")
("nc" "Conlanging" entry
  (file+headline org-conlanging-file "Note")
  (file (expand-file-name "notes.orgcaptmpl" org-agenda-capture-template-directory)))
("nn" "General" entry
  (file+headline org-default-notes-file "General")
  (file (expand-file-name "notes.orgcaptmpl" org-agenda-capture-template-directory)))
("nN" "Novel" entry
  (file+headline org-novel-notes-file "Note")
  (file (expand-file-name "notes.orgcaptmpl" org-agenda-capture-template-directory)))
("nq" "Quote" entry
  (file+headline org-default-notes-file "Quote")
  (file (expand-file-name "notes-quote.orgcaptmpl" org-agenda-capture-template-directory)))
("nw" "Worldbuilding" entry
  (file+headline org-wordbuilding-file "Note")
  (file (expand-file-name "notes.orgcaptmpl" org-agenda-capture-template-directory)))
("N" "Novel")
("Ni" "Ideas" entry
  (file+headline org-novel-notes-file "Ideas")
  (file (expand-file-name "notes.orgcaptmpl" org-agenda-capture-template-directory)))
("p" "Protocol" entry
  (file+headline org-default-notes-file "Link")
  (file (expand-file-name "protocol.orgcaptmpl" org-agenda-capture-template-directory)))
("r" "Resources")
("rc" "Conlanging" entry
  (file+headline org-conlanging-file "Resources")
  (file (expand-file-name "resource.orgcaptmpl" org-agenda-capture-template-directory)))
("re" "Emacs" entry
  (file+headline org-default-notes-file "Emacs")
  (file (expand-file-name "resource.orgcaptmpl" org-agenda-capture-template-directory)))
("ri" "Informatique" entry
  (file+headline org-default-notes-file "Informatique")
  (file (expand-file-name "resource.orgcaptmpl" org-agenda-capture-template-directory)))
("rl" "Linguistics" entry
  (file+headline org-default-notes-file "Linguistics")
  (file (expand-file-name "resource.orgcaptmpl" org-agenda-capture-template-directory)))
("rL" "Linux" entry
  (file+headline org-default-notes-file "Linux")
  (file (expand-file-name "resource.orgcaptmpl" org-agenda-capture-template-directory)))
("rw" "Worldbuilding" entry
  (file+headline org-wordbuilding-file "Resources")
  (file (expand-file-name "resource.orgcaptmpl" org-agenda-capture-template-directory)))
("t" "Tasks")
("tb" "Birthday" entry
  (file+headline org-private-agenda-file "Birthday")
  (file (expand-file-name "birthday.orgcaptmpl" org-agenda-capture-template-directory)))
("te" "Event" entry
  (file+headline org-private-agenda-file "Event")
  (file (expand-file-name "event.orgcaptmpl" org-agenda-capture-template-directory)))
("th" "Health" entry
  (file+headline org-private-agenda-file "Health")
  (file (expand-file-name "health.orgcaptmpl" org-agenda-capture-template-directory)))
#+end_example

The capture templates are set like so:
#+name: org-capture-templates
#+begin_src emacs-lisp :tangle yes :results silent
(setq org-capture-templates
      '(
        <<org-capture-shortcuts-gen()>>))
#+end_src

